In [1]:
import numpy as np
import pandas as pd

In [2]:
arr = np.array([[10,20,np.nan],[5,np.nan,np.nan],[21,np.nan,10]])

In [3]:
arr

array([[10., 20., nan],
       [ 5., nan, nan],
       [21., nan, 10.]])

In [5]:
df = pd.DataFrame(arr,index = ["Index1","Index2","Index3"],columns = ["Column1","Column2","Column3"])

In [6]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [7]:
df.dropna()

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [8]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [9]:
df.dropna(axis = 1)

        Column1
Index1     10.0
Index2      5.0
Index3     21.0

In [10]:
df.dropna(thresh = 2)

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index3     21.0      NaN     10.0

In [11]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [12]:
df.fillna(value = 1)

        Column1  Column2  Column3
Index1     10.0     20.0      1.0
Index2      5.0      1.0      1.0
Index3     21.0      1.0     10.0

In [15]:
df.sum()

Column1    36.0
Column2    20.0
Column3    10.0
dtype: float64

In [16]:
df.sum().sum()

66.0

In [17]:
df.size

9

In [19]:
df.isnull().sum()

Column1    0
Column2    2
Column3    2
dtype: int64

In [20]:
df.isnull().sum().sum()

4

In [23]:
def calculateMean(df):
    totalSum = df.sum().sum()
    totalNum = df.size - df.isnull().sum().sum()
    return totalSum / totalNum

In [25]:
df.fillna(value = calculateMean(df),inplace = True)

In [26]:
df

        Column1  Column2  Column3
Index1     10.0     20.0     13.2
Index2      5.0     13.2     13.2
Index3     21.0     13.2     10.0